---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.IneligibleElementsForParts
source: html/6c254471-da48-da52-be33-d0fc610dc030.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.IneligibleElementsForParts Property

Creating parts from ineligible elements

## Syntax (C#)
```csharp
public static FailureDefinitionId IneligibleElementsForParts { get; }
```